AakashKedia22/wolfssl-examples/am26xx/wolfssl.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM263Px" --package "ZCZ_S" --part "AM263P4" --context "hsm0-0" --product "TIFS@07.03.01" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.20.0+3587"}
 */

/**
 * Import the modules used in this configuration.
 */
const dthe           = scripting.addModule("/drivers/dthe/dthe", {}, false);
const dthe1          = dthe.addInstance();
const mpu_firewall   = scripting.addModule("/drivers/mpu_firewall/mpu_firewall", {}, false);
const mpu_firewall1  = mpu_firewall.addInstance();
const mpu_firewall2  = mpu_firewall.addInstance();
const mpu_firewall3  = mpu_firewall.addInstance();
const mpu_firewall4  = mpu_firewall.addInstance();
const mpu_firewall5  = mpu_firewall.addInstance();
const mpu_firewall6  = mpu_firewall.addInstance();
const mpu_firewall7  = mpu_firewall.addInstance();
const mpu_firewall8  = mpu_firewall.addInstance();
const mpu_firewall9  = mpu_firewall.addInstance();
const mpu_firewall10 = mpu_firewall.addInstance();
const mpu_firewall11 = mpu_firewall.addInstance();
const mpu_firewall12 = mpu_firewall.addInstance();
const mpu_firewall13 = mpu_firewall.addInstance();
const mpu_firewall14 = mpu_firewall.addInstance();
const mpu_firewall15 = mpu_firewall.addInstance();
const mpu_firewall16 = mpu_firewall.addInstance();
const mpu_firewall17 = mpu_firewall.addInstance();
const mpu_firewall18 = mpu_firewall.addInstance();
const mpu_firewall19 = mpu_firewall.addInstance();
const mpu_firewall20 = mpu_firewall.addInstance();
const mpu_firewall21 = mpu_firewall.addInstance();
const mpu_firewall22 = mpu_firewall.addInstance();
const mpu_firewall23 = mpu_firewall.addInstance();
const clock          = scripting.addModule("/kernel/dpl/clock");
const debug_log      = scripting.addModule("/kernel/dpl/debug_log");
const dpl_cfg        = scripting.addModule("/kernel/dpl/dpl_cfg");
const mpu_armv7      = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71     = mpu_armv7.addInstance();
const mpu_armv72     = mpu_armv7.addInstance();
const mpu_armv73     = mpu_armv7.addInstance();
const hsmserver      = scripting.addModule("/modules/hsmserver/hsmserver", {}, false);
const hsmserver1     = hsmserver.addInstance();
const keyring        = scripting.addModule("/modules/keyring/keyring", {}, false);
const keyring1       = keyring.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
dthe1.$name = "CONFIG_DTHE0";
dthe1.enableDMA = true;

mpu_firewall1.$name                          = "CONFIG_MPU_FIREWALL0";
mpu_firewall1.mpu_region.create(1);
mpu_firewall1.mpu_region[0].$name            = "CONFIG_MPU_FIREWALL_REGION0";
mpu_firewall1.mpu_region[0].permissionConfig = ["PER0","PER1","PER2","PER3","PER4","PER5","PER6","PER7"];
mpu_firewall1.mpu_region[0].aidConfig        = ["AIDX","CPSW","ICSSM","M4FSS0_0","R5FSS0_0","R5FSS0_1","R5FSS1_0","R5FSS1_1"];
mpu_firewall1.mpu_region[0].allaidConfig     = true;
mpu_firewall1.mpu_region[0].allPermissions   = true;

mpu_firewall2.$name                          = "CONFIG_MPU_FIREWALL1";
mpu_firewall2.instance                       = "L2OCRAM_BANK1_SLV";
mpu_firewall2.mpu_region.create(1);
mpu_firewall2.mpu_region[0].$name            = "CONFIG_MPU_FIREWALL_REGION1";
mpu_firewall2.mpu_region[0].permissionConfig = ["PER0","PER1","PER2","PER3","PER4","PER5","PER6","PER7"];
mpu_firewall2.mpu_region[0].aidConfig        = ["AIDX","CPSW","ICSSM","M4FSS0_0","R5FSS0_0","R5FSS0_1","R5FSS1_0","R5FSS1_1"];
mpu_firewall2.mpu_region[0].allaidConfig     = true;
mpu_firewall2.mpu_region[0].allPermissions   = true;

mpu_firewall3.$name                        = "CONFIG_MPU_FIREWALL2";
mpu_firewall3.instance                     = "L2OCRAM_BANK2_SLV";
mpu_firewall3.mpu_region.create(1);
mpu_firewall3.mpu_region[0].$name          = "CONFIG_MPU_FIREWALL_REGION2";
mpu_firewall3.mpu_region[0].allaidConfig   = true;
mpu_firewall3.mpu_region[0].allPermissions = true;

mpu_firewall4.$name                        = "CONFIG_MPU_FIREWALL3";
mpu_firewall4.instance                     = "L2OCRAM_BANK3_SLV";
mpu_firewall4.mpu_region.create(1);
mpu_firewall4.mpu_region[0].$name          = "CONFIG_MPU_FIREWALL_REGION3";
mpu_firewall4.mpu_region[0].allaidConfig   = true;
mpu_firewall4.mpu_region[0].allPermissions = true;

mpu_firewall5.$name                          = "CONFIG_MPU_FIREWALL4";
mpu_firewall5.instance                       = "R5SS0_CORE0_AXIS_SLV";
mpu_firewall5.mpu_region.create(5);
mpu_firewall5.mpu_region[0].$name            = "CONFIG_MPU_FIREWALL_REGION4";
mpu_firewall5.mpu_region[0].permissionConfig = ["PER0","PER1","PER2","PER3","PER4","PER5","PER6","PER7"];
mpu_firewall5.mpu_region[0].allaidConfig     = true;
mpu_firewall5.mpu_region[0].allPermissions   = true;
mpu_firewall5.mpu_region[1].$name            = "CONFIG_MPU_FIREWALL_REGION9";
mpu_firewall5.mpu_region[1].startAddr        = 0x78100000;
mpu_firewall5.mpu_region[1].aidConfig        = ["AIDX","CPSW","ICSSM","M4FSS0_0","R5FSS0_0","R5FSS0_1","R5FSS1_0","R5FSS1_1"];
mpu_firewall5.mpu_region[1].allaidConfig     = true;
mpu_firewall5.mpu_region[1].allPermissions   = true;
mpu_firewall5.mpu_region[2].$name            = "CONFIG_MPU_FIREWALL_REGION10";
mpu_firewall5.mpu_region[2].startAddr        = 0x74000000;
mpu_firewall5.mpu_region[2].size             = 0x800000;
mpu_firewall5.mpu_region[2].allaidConfig     = true;
mpu_firewall5.mpu_region[2].allPermissions   = true;
mpu_firewall5.mpu_region[3].$name            = "CONFIG_MPU_FIREWALL_REGION20";
mpu_firewall5.mpu_region[3].startAddr        = 0x74800000;
mpu_firewall5.mpu_region[3].size             = 0x800000;
mpu_firewall5.mpu_region[3].allaidConfig     = true;
mpu_firewall5.mpu_region[3].allPermissions   = true;
mpu_firewall5.mpu_region[4].$name            = "CONFIG_MPU_FIREWALL_REGION51";
mpu_firewall5.mpu_region[4].startAddr        = 0x78060000;
mpu_firewall5.mpu_region[4].allaidConfig     = true;
mpu_firewall5.mpu_region[4].allPermissions   = true;
mpu_firewall5.mpu_region[4].size             = 0x400;

