AakashKedia22/wolfssl-examples/am26xx/wolfssl.syscfg
mpu_firewall6.$name                          = "CONFIG_MPU_FIREWALL5";
mpu_firewall6.instance                       = "R5SS0_CORE1_AXIS_SLV";
mpu_firewall6.mpu_region.create(5);
mpu_firewall6.mpu_region[0].$name            = "CONFIG_MPU_FIREWALL_REGION5";
mpu_firewall6.mpu_region[0].permissionConfig = ["PER0","PER1","PER2","PER3","PER4","PER5","PER6","PER7"];
mpu_firewall6.mpu_region[0].allaidConfig     = true;
mpu_firewall6.mpu_region[0].allPermissions   = true;
mpu_firewall6.mpu_region[1].$name            = "CONFIG_MPU_FIREWALL_REGION21";
mpu_firewall6.mpu_region[1].startAddr        = 0x78300000;
mpu_firewall6.mpu_region[1].allaidConfig     = true;
mpu_firewall6.mpu_region[1].allPermissions   = true;
mpu_firewall6.mpu_region[2].$name            = "CONFIG_MPU_FIREWALL_REGION22";
mpu_firewall6.mpu_region[2].startAddr        = 0x75000000;
mpu_firewall6.mpu_region[2].size             = 0x800000;
mpu_firewall6.mpu_region[2].allaidConfig     = true;
mpu_firewall6.mpu_region[2].allPermissions   = true;
mpu_firewall6.mpu_region[3].$name            = "CONFIG_MPU_FIREWALL_REGION23";
mpu_firewall6.mpu_region[3].startAddr        = 0x75800000;
mpu_firewall6.mpu_region[3].size             = 0x800000;
mpu_firewall6.mpu_region[3].allaidConfig     = true;
mpu_firewall6.mpu_region[3].allPermissions   = true;
mpu_firewall6.mpu_region[4].$name            = "CONFIG_MPU_FIREWALL_REGION52";
mpu_firewall6.mpu_region[4].startAddr        = 0x78260000;
mpu_firewall6.mpu_region[4].allaidConfig     = true;
mpu_firewall6.mpu_region[4].allPermissions   = true;
mpu_firewall6.mpu_region[4].size             = 0x400;

mpu_firewall7.$name                        = "CONFIG_MPU_FIREWALL6";
mpu_firewall7.instance                     = "R5SS1_CORE0_AXIS_SLV";
mpu_firewall7.mpu_region.create(5);
mpu_firewall7.mpu_region[0].$name          = "CONFIG_MPU_FIREWALL_REGION6";
mpu_firewall7.mpu_region[0].allaidConfig   = true;
mpu_firewall7.mpu_region[0].allPermissions = true;
mpu_firewall7.mpu_region[1].$name          = "CONFIG_MPU_FIREWALL_REGION24";
mpu_firewall7.mpu_region[1].startAddr      = 0x78500000;
mpu_firewall7.mpu_region[1].allPermissions = true;
mpu_firewall7.mpu_region[1].allaidConfig   = true;
mpu_firewall7.mpu_region[2].$name          = "CONFIG_MPU_FIREWALL_REGION25";
mpu_firewall7.mpu_region[2].startAddr      = 0x76000000;
mpu_firewall7.mpu_region[2].size           = 0x800000;
mpu_firewall7.mpu_region[2].allaidConfig   = true;
mpu_firewall7.mpu_region[2].allPermissions = true;
mpu_firewall7.mpu_region[3].$name          = "CONFIG_MPU_FIREWALL_REGION26";
mpu_firewall7.mpu_region[3].startAddr      = 0x76800000;
mpu_firewall7.mpu_region[3].size           = 0x800000;
mpu_firewall7.mpu_region[3].allaidConfig   = true;
mpu_firewall7.mpu_region[3].allPermissions = true;
mpu_firewall7.mpu_region[4].$name          = "CONFIG_MPU_FIREWALL_REGION53";
mpu_firewall7.mpu_region[4].startAddr      = 0x78460000;
mpu_firewall7.mpu_region[4].allaidConfig   = true;
mpu_firewall7.mpu_region[4].allPermissions = true;
mpu_firewall7.mpu_region[4].size           = 0x400;

mpu_firewall8.$name                        = "CONFIG_MPU_FIREWALL7";
mpu_firewall8.instance                     = "R5SS1_CORE1_AXIS_SLV";
mpu_firewall8.mpu_region.create(5);
mpu_firewall8.mpu_region[0].$name          = "CONFIG_MPU_FIREWALL_REGION7";
mpu_firewall8.mpu_region[0].allaidConfig   = true;
mpu_firewall8.mpu_region[0].allPermissions = true;
mpu_firewall8.mpu_region[1].$name          = "CONFIG_MPU_FIREWALL_REGION27";
mpu_firewall8.mpu_region[1].startAddr      = 0x78700000;
mpu_firewall8.mpu_region[1].allaidConfig   = true;
mpu_firewall8.mpu_region[1].allPermissions = true;
mpu_firewall8.mpu_region[2].$name          = "CONFIG_MPU_FIREWALL_REGION28";
mpu_firewall8.mpu_region[2].startAddr      = 0x77000000;
mpu_firewall8.mpu_region[2].size           = 0x800000;
mpu_firewall8.mpu_region[2].allaidConfig   = true;
mpu_firewall8.mpu_region[2].allPermissions = true;
mpu_firewall8.mpu_region[3].$name          = "CONFIG_MPU_FIREWALL_REGION29";
mpu_firewall8.mpu_region[3].startAddr      = 0x77800000;
mpu_firewall8.mpu_region[3].size           = 0x800000;
mpu_firewall8.mpu_region[3].allaidConfig   = true;
mpu_firewall8.mpu_region[3].allPermissions = true;
mpu_firewall8.mpu_region[4].$name          = "CONFIG_MPU_FIREWALL_REGION54";
mpu_firewall8.mpu_region[4].startAddr      = 0x78660000;
mpu_firewall8.mpu_region[4].allaidConfig   = true;
mpu_firewall8.mpu_region[4].allPermissions = true;
mpu_firewall8.mpu_region[4].size           = 0x400;

mpu_firewall9.$name                        = "CONFIG_MPU_FIREWALL8";
mpu_firewall9.instance                     = "MBOX_RAM_SLV";
mpu_firewall9.mpu_region.create(1);
mpu_firewall9.mpu_region[0].$name          = "CONFIG_MPU_FIREWALL_REGION8";
mpu_firewall9.mpu_region[0].allaidConfig   = true;
mpu_firewall9.mpu_region[0].allPermissions = true;

mpu_firewall10.$name                          = "CONFIG_MPU_FIREWALL10";
mpu_firewall10.instance                       = "HSM_SLV";
mpu_firewall10.mpu_region.create(7);
mpu_firewall10.mpu_region[0].$name            = "CONFIG_MPU_FIREWALL_REGION18";
mpu_firewall10.mpu_region[0].startAddr        = 0x44000400;
mpu_firewall10.mpu_region[0].size             = 0x400;
mpu_firewall10.mpu_region[0].aidConfig        = ["M4FSS0_0","R5FSS0_0","R5FSS0_1"];
mpu_firewall10.mpu_region[0].permissionConfig = ["PER0","PER1","PER3","PER4","PER6","PER7"];
mpu_firewall10.mpu_region[1].$name            = "CONFIG_MPU_FIREWALL_REGION19";
mpu_firewall10.mpu_region[1].startAddr        = 0x44000000;
mpu_firewall10.mpu_region[1].size             = 0x400;
mpu_firewall10.mpu_region[1].aidConfig        = ["R5FSS0_0","R5FSS0_1"];
mpu_firewall10.mpu_region[1].permissionConfig = ["PER0","PER3"];
mpu_firewall10.mpu_region[2].$name            = "CONFIG_MPU_FIREWALL_REGION49";
mpu_firewall10.mpu_region[2].startAddr        = 0x40020000;
mpu_firewall10.mpu_region[2].size             = 0x100000;
mpu_firewall10.mpu_region[2].permissionConfig = ["PER0","PER3"];
mpu_firewall10.mpu_region[3].$name            = "CONFIG_MPU_FIREWALL_REGION50";
mpu_firewall10.mpu_region[3].startAddr        = 0x40140000;
mpu_firewall10.mpu_region[3].size             = 0x100000;
mpu_firewall10.mpu_region[3].permissionConfig = ["PER0","PER3"];
mpu_firewall10.mpu_region[4].$name            = "CONFIG_MPU_FIREWALL_REGION65";
mpu_firewall10.mpu_region[4].startAddr        = 0x40260000;
mpu_firewall10.mpu_region[4].size             = 0x80400;
mpu_firewall10.mpu_region[4].permissionConfig = ["PER0","PER3"];
mpu_firewall10.mpu_region[5].$name            = "CONFIG_MPU_FIREWALL_REGION67";
mpu_firewall10.mpu_region[5].startAddr        = 0x40000000;
mpu_firewall10.mpu_region[5].aidConfig        = ["M4FSS0_0"];
mpu_firewall10.mpu_region[5].permissionConfig = ["PER0","PER1","PER2","PER3","PER4","PER5","PER6","PER7"];
mpu_firewall10.mpu_region[5].allPermissions   = true;
mpu_firewall10.mpu_region[6].$name            = "CONFIG_MPU_FIREWALL_REGION68";
mpu_firewall10.mpu_region[6].startAddr        = 0x20020000;
mpu_firewall10.mpu_region[6].aidConfig        = ["M4FSS0_0"];
mpu_firewall10.mpu_region[6].permissionConfig = ["PER0","PER1","PER2","PER3","PER4","PER5","PER6","PER7"];
mpu_firewall10.mpu_region[6].allPermissions   = true;
mpu_firewall10.mpu_region[6].size             = 0x40000;

mpu_firewall11.$name                        = "CONFIG_MPU_FIREWALL11";
mpu_firewall11.instance                     = "DTHE_SLV";
mpu_firewall11.mpu_region.create(8);
mpu_firewall11.mpu_region[0].$name          = "CONFIG_MPU_FIREWALL_REGION11";
mpu_firewall11.mpu_region[0].allPermissions = true;
mpu_firewall11.mpu_region[0].size           = 0x800;
mpu_firewall11.mpu_region[0].aidConfig      = ["M4FSS0_0"];
mpu_firewall11.mpu_region[1].$name          = "CONFIG_MPU_FIREWALL_REGION42";
mpu_firewall11.mpu_region[1].startAddr      = 0xCE010000;
mpu_firewall11.mpu_region[1].aidConfig      = ["M4FSS0_0"];
mpu_firewall11.mpu_region[1].allPermissions = true;
mpu_firewall11.mpu_region[1].size           = 0x8000;
mpu_firewall11.mpu_region[2].$name          = "CONFIG_MPU_FIREWALL_REGION43";
mpu_firewall11.mpu_region[2].startAddr      = 0xCE00A000;
mpu_firewall11.mpu_region[2].aidConfig      = ["M4FSS0_0"];
mpu_firewall11.mpu_region[2].allPermissions = true;
mpu_firewall11.mpu_region[2].size           = 0x1000;
mpu_firewall11.mpu_region[3].$name          = "CONFIG_MPU_FIREWALL_REGION44";
mpu_firewall11.mpu_region[3].startAddr      = 0xCE006000;
mpu_firewall11.mpu_region[3].aidConfig      = ["M4FSS0_0"];
mpu_firewall11.mpu_region[3].allPermissions = true;
mpu_firewall11.mpu_region[3].size           = 0x1000;
mpu_firewall11.mpu_region[4].$name          = "CONFIG_MPU_FIREWALL_REGION45";
mpu_firewall11.mpu_region[4].startAddr      = 0xCE004000;
mpu_firewall11.mpu_region[4].aidConfig      = ["M4FSS0_0"];
mpu_firewall11.mpu_region[4].allPermissions = true;
mpu_firewall11.mpu_region[4].size           = 0x1000;
mpu_firewall11.mpu_region[5].$name          = "CONFIG_MPU_FIREWALL_REGION46";
mpu_firewall11.mpu_region[5].startAddr      = 0xCE007000;
mpu_firewall11.mpu_region[5].size           = 0x1000;
mpu_firewall11.mpu_region[5].allaidConfig   = true;
mpu_firewall11.mpu_region[5].allPermissions = true;
mpu_firewall11.mpu_region[6].$name          = "CONFIG_MPU_FIREWALL_REGION47";
mpu_firewall11.mpu_region[6].startAddr      = 0xCE005000;
mpu_firewall11.mpu_region[6].size           = 0x1000;
mpu_firewall11.mpu_region[6].allaidConfig   = true;
mpu_firewall11.mpu_region[6].allPermissions = true;
mpu_firewall11.mpu_region[7].$name          = "CONFIG_MPU_FIREWALL_REGION48";
mpu_firewall11.mpu_region[7].startAddr      = 0xCE000800;
mpu_firewall11.mpu_region[7].size           = 0x800;
mpu_firewall11.mpu_region[7].allaidConfig   = true;
mpu_firewall11.mpu_region[7].allPermissions = true;

mpu_firewall12.$name                          = "CONFIG_MPU_FIREWALL12";
mpu_firewall12.instance                       = "SCRM2SCRP0_SLV";
mpu_firewall12.mpu_region.create(3);
mpu_firewall12.mpu_region[0].$name            = "CONFIG_MPU_FIREWALL_REGION30";
mpu_firewall12.mpu_region[0].startAddr        = 0x53600000;
mpu_firewall12.mpu_region[0].size             = 0x400;
mpu_firewall12.mpu_region[0].aidConfig        = ["M4FSS0_0"];
mpu_firewall12.mpu_region[0].permissionConfig = ["PER0","PER1","PER2","PER3","PER4","PER5","PER6","PER7"];
mpu_firewall12.mpu_region[0].allPermissions   = true;
mpu_firewall12.mpu_region[1].$name            = "CONFIG_MPU_FIREWALL_REGION31";
mpu_firewall12.mpu_region[1].startAddr        = 0x53600400;
mpu_firewall12.mpu_region[1].size             = 0xC9FFC00;
mpu_firewall12.mpu_region[1].allaidConfig     = true;
mpu_firewall12.mpu_region[1].allPermissions   = true;
mpu_firewall12.mpu_region[2].$name            = "CONFIG_MPU_FIREWALL_REGION13";
mpu_firewall12.mpu_region[2].size             = 0x3600000;
mpu_firewall12.mpu_region[2].allaidConfig     = true;
mpu_firewall12.mpu_region[2].allPermissions   = true;

mpu_firewall13.$name                        = "CONFIG_MPU_FIREWALL13";
mpu_firewall13.instance                     = "SCRM2SCRP1_SLV";
mpu_firewall13.mpu_region.create(3);
mpu_firewall13.mpu_region[0].$name          = "CONFIG_MPU_FIREWALL_REGION32";
mpu_firewall13.mpu_region[0].startAddr      = 0x53600000;
mpu_firewall13.mpu_region[0].size           = 0x400;
mpu_firewall13.mpu_region[0].aidConfig      = ["M4FSS0_0"];
mpu_firewall13.mpu_region[0].allPermissions = true;
mpu_firewall13.mpu_region[1].$name          = "CONFIG_MPU_FIREWALL_REGION33";
mpu_firewall13.mpu_region[1].startAddr      = 0x53600400;
mpu_firewall13.mpu_region[1].size           = 0xC9FFC00;
mpu_firewall13.mpu_region[1].allaidConfig   = true;
mpu_firewall13.mpu_region[1].allPermissions = true;
mpu_firewall13.mpu_region[2].$name          = "CONFIG_MPU_FIREWALL_REGION66";
mpu_firewall13.mpu_region[2].size           = 0x3600000;
mpu_firewall13.mpu_region[2].allaidConfig   = true;
mpu_firewall13.mpu_region[2].allPermissions = true;

