AakashKedia22/wolfssl-examples/am26xx/wolfssl.syscfg
mpu_firewall14.$name                        = "CONFIG_MPU_FIREWALL14";
mpu_firewall14.instance                     = "R5SS0_CORE0_AHB_MST";
mpu_firewall14.mpu_region.create(3);
mpu_firewall14.mpu_region[0].$name          = "CONFIG_MPU_FIREWALL_REGION34";
mpu_firewall14.mpu_region[0].startAddr      = 0x53600000;
mpu_firewall14.mpu_region[0].size           = 0x400;
mpu_firewall14.mpu_region[0].aidConfig      = ["M4FSS0_0"];
mpu_firewall14.mpu_region[0].allPermissions = true;
mpu_firewall14.mpu_region[1].$name          = "CONFIG_MPU_FIREWALL_REGION35";
mpu_firewall14.mpu_region[1].startAddr      = 0x53600400;
mpu_firewall14.mpu_region[1].size           = 0xC9FFC00;
mpu_firewall14.mpu_region[1].allaidConfig   = true;
mpu_firewall14.mpu_region[1].allPermissions = true;
mpu_firewall14.mpu_region[2].$name          = "CONFIG_MPU_FIREWALL_REGION12";
mpu_firewall14.mpu_region[2].size           = 0x3600000;
mpu_firewall14.mpu_region[2].allaidConfig   = true;
mpu_firewall14.mpu_region[2].allPermissions = true;

mpu_firewall15.$name                        = "CONFIG_MPU_FIREWALL15";
mpu_firewall15.instance                     = "R5SS0_CORE1_AHB_MST";
mpu_firewall15.mpu_region.create(3);
mpu_firewall15.mpu_region[0].$name          = "CONFIG_MPU_FIREWALL_REGION36";
mpu_firewall15.mpu_region[0].startAddr      = 0x53600000;
mpu_firewall15.mpu_region[0].size           = 0x400;
mpu_firewall15.mpu_region[0].aidConfig      = ["M4FSS0_0"];
mpu_firewall15.mpu_region[0].allPermissions = true;
mpu_firewall15.mpu_region[1].$name          = "CONFIG_MPU_FIREWALL_REGION37";
mpu_firewall15.mpu_region[1].startAddr      = 0x53600400;
mpu_firewall15.mpu_region[1].size           = 0xC9FFC00;
mpu_firewall15.mpu_region[1].allaidConfig   = true;
mpu_firewall15.mpu_region[1].allPermissions = true;
mpu_firewall15.mpu_region[2].$name          = "CONFIG_MPU_FIREWALL_REGION14";
mpu_firewall15.mpu_region[2].size           = 0x3600000;
mpu_firewall15.mpu_region[2].allaidConfig   = true;
mpu_firewall15.mpu_region[2].allPermissions = true;

mpu_firewall16.$name                        = "CONFIG_MPU_FIREWALL16";
mpu_firewall16.instance                     = "R5SS1_CORE0_AHB_MST";
mpu_firewall16.mpu_region.create(3);
mpu_firewall16.mpu_region[0].$name          = "CONFIG_MPU_FIREWALL_REGION38";
mpu_firewall16.mpu_region[0].allPermissions = true;
mpu_firewall16.mpu_region[0].startAddr      = 0x53600000;
mpu_firewall16.mpu_region[0].size           = 0x400;
mpu_firewall16.mpu_region[0].aidConfig      = ["M4FSS0_0"];
mpu_firewall16.mpu_region[1].$name          = "CONFIG_MPU_FIREWALL_REGION41";
mpu_firewall16.mpu_region[1].startAddr      = 0x53600400;
mpu_firewall16.mpu_region[1].size           = 0xC9FFC00;
mpu_firewall16.mpu_region[1].allaidConfig   = true;
mpu_firewall16.mpu_region[1].allPermissions = true;
mpu_firewall16.mpu_region[2].$name          = "CONFIG_MPU_FIREWALL_REGION15";
mpu_firewall16.mpu_region[2].size           = 0x3600000;
mpu_firewall16.mpu_region[2].allaidConfig   = true;
mpu_firewall16.mpu_region[2].allPermissions = true;

mpu_firewall17.$name                        = "CONFIG_MPU_FIREWALL17";
mpu_firewall17.instance                     = "R5SS1_CORE1_AHB_MST";
mpu_firewall17.mpu_region.create(3);
mpu_firewall17.mpu_region[0].$name          = "CONFIG_MPU_FIREWALL_REGION39";
mpu_firewall17.mpu_region[0].startAddr      = 0x53600000;
mpu_firewall17.mpu_region[0].size           = 0x400;
mpu_firewall17.mpu_region[0].aidConfig      = ["M4FSS0_0"];
mpu_firewall17.mpu_region[0].allPermissions = true;
mpu_firewall17.mpu_region[1].$name          = "CONFIG_MPU_FIREWALL_REGION40";
mpu_firewall17.mpu_region[1].startAddr      = 0x53600400;
mpu_firewall17.mpu_region[1].size           = 0xC9FFC00;
mpu_firewall17.mpu_region[1].allPermissions = true;
mpu_firewall17.mpu_region[1].allaidConfig   = true;
mpu_firewall17.mpu_region[2].$name          = "CONFIG_MPU_FIREWALL_REGION16";
mpu_firewall17.mpu_region[2].size           = 0x3600000;
mpu_firewall17.mpu_region[2].allaidConfig   = true;
mpu_firewall17.mpu_region[2].allPermissions = true;

mpu_firewall18.$name                        = "CONFIG_MPU_FIREWALL9";
mpu_firewall18.instance                     = "L2OCRAM_BANK4_SLV";
mpu_firewall18.mpu_region.create(1);
mpu_firewall18.mpu_region[0].$name          = "CONFIG_MPU_FIREWALL_REGION55";
mpu_firewall18.mpu_region[0].allaidConfig   = true;
mpu_firewall18.mpu_region[0].allPermissions = true;

mpu_firewall19.$name                        = "CONFIG_MPU_FIREWALL18";
mpu_firewall19.instance                     = "L2OCRAM_BANK5_SLV";
mpu_firewall19.mpu_region.create(1);
mpu_firewall19.mpu_region[0].$name          = "CONFIG_MPU_FIREWALL_REGION56";
mpu_firewall19.mpu_region[0].allaidConfig   = true;
mpu_firewall19.mpu_region[0].allPermissions = true;

mpu_firewall20.$name                        = "CONFIG_MPU_FIREWALL19";
mpu_firewall20.instance                     = "OSPI0_SLV";
mpu_firewall20.mpu_region.create(3);
mpu_firewall20.mpu_region[0].$name          = "CONFIG_MPU_FIREWALL_REGION57";
mpu_firewall20.mpu_region[0].allaidConfig   = true;
mpu_firewall20.mpu_region[0].allPermissions = true;
mpu_firewall20.mpu_region[1].$name          = "CONFIG_MPU_FIREWALL_REGION58";
mpu_firewall20.mpu_region[1].allaidConfig   = true;
mpu_firewall20.mpu_region[1].allPermissions = true;
mpu_firewall20.mpu_region[1].startAddr      = 0x80000000;
mpu_firewall20.mpu_region[2].$name          = "CONFIG_MPU_FIREWALL_REGION59";
mpu_firewall20.mpu_region[2].allaidConfig   = true;
mpu_firewall20.mpu_region[2].allPermissions = true;
mpu_firewall20.mpu_region[2].startAddr      = 0x88000000;

mpu_firewall21.$name                        = "CONFIG_MPU_FIREWALL20";
mpu_firewall21.instance                     = "OSPI0_CFG_SLV";
mpu_firewall21.mpu_region.create(1);
mpu_firewall21.mpu_region[0].$name          = "CONFIG_MPU_FIREWALL_REGION60";
mpu_firewall21.mpu_region[0].allaidConfig   = true;
mpu_firewall21.mpu_region[0].allPermissions = true;

mpu_firewall22.$name                        = "CONFIG_MPU_FIREWALL21";
mpu_firewall22.instance                     = "R5SS0_SLV";
mpu_firewall22.mpu_region.create(1);
mpu_firewall22.mpu_region[0].$name          = "CONFIG_MPU_FIREWALL_REGION63";
mpu_firewall22.mpu_region[0].allaidConfig   = true;
mpu_firewall22.mpu_region[0].allPermissions = true;

mpu_firewall23.$name                        = "CONFIG_MPU_FIREWALL22";
mpu_firewall23.instance                     = "R5SS1_SLV";
mpu_firewall23.mpu_region.create(1);
mpu_firewall23.mpu_region[0].$name          = "CONFIG_MPU_FIREWALL_REGION64";
mpu_firewall23.mpu_region[0].allaidConfig   = true;
mpu_firewall23.mpu_region[0].allPermissions = true;

clock.timerInputClkHz = 20000000;

debug_log.enableCssLog         = false;
debug_log.enableMemLog         = true;
debug_log.enableLogZoneError   = false;
debug_log.enableLogZoneWarning = false;

mpu_armv71.$name      = "CONFIG_MPU_REGION0";
mpu_armv71.size       = 31;
mpu_armv71.attributes = "Device";

mpu_armv72.$name      = "CONFIG_MPU_REGION1";
mpu_armv72.size       = 11;
mpu_armv72.baseAddr   = 0x44000000;
mpu_armv72.attributes = "Cached+Sharable";

mpu_armv73.$name      = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr   = 0xCE000000;
mpu_armv73.size       = 25;
mpu_armv73.attributes = "Device";

hsmserver1.$name = "CONFIG_HSMSERVER0";

keyring1.$name = "CONFIG_KEYRING0";
